Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/edc/PIC32CX5112MTSH128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM2" edc:cname="FLEX_US_NER" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:impl="0xFF" edc:_addr="0x40008244">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM2">
            <edc:SFRFieldDef edc:cname="NB_ERRORS" edc:nzwidth="0x8" edc:desc="Number of Errors"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x40008248"/>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM2" edc:cname="FLEX_US_IF" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x4000824C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM2">
            <edc:SFRFieldDef edc:cname="IRDA_FILTER" edc:nzwidth="0x8" edc:desc="IrDA Filter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM2" edc:cname="FLEX_US_MAN" edc:nzwidth="0x20" edc:access="nnnn--nn----nnnn---n--nn----nnnn" edc:impl="0xF30F130F" edc:_addr="0x40008250">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM2">
            <edc:SFRFieldDef edc:cname="TX_PL" edc:nzwidth="0x4" edc:desc="Transmitter Preamble Length"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TX_PP" edc:nzwidth="0x2" edc:desc="Transmitter Preamble Pattern">
              <edc:SFRFieldSemantic edc:cname="ALL_ONE" edc:desc="The preamble is composed of '1's" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ALL_ZERO" edc:desc="The preamble is composed of '0's" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="ZERO_ONE" edc:desc="The preamble is composed of '01's" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="ONE_ZERO" edc:desc="The preamble is composed of '10's" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TX_MPOL" edc:nzwidth="0x1" edc:desc="Transmitter Manchester Polarity"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RX_PL" edc:nzwidth="0x4" edc:desc="Receiver Preamble Length"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RX_PP" edc:nzwidth="0x2" edc:desc="Receiver Preamble Pattern detected">
              <edc:SFRFieldSemantic edc:cname="ALL_ONE" edc:desc="The preamble is composed of '1's" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ALL_ZERO" edc:desc="The preamble is composed of '0's" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="ZERO_ONE" edc:desc="The preamble is composed of '01's" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="ONE_ZERO" edc:desc="The preamble is composed of '10's" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RX_MPOL" edc:nzwidth="0x1" edc:desc="Receiver Manchester Polarity"/>
            <edc:SFRFieldDef edc:cname="ONE" edc:nzwidth="0x1" edc:desc="Must Be Set to 1"/>
            <edc:SFRFieldDef edc:cname="DRIFT" edc:nzwidth="0x1" edc:desc="Drift Compensation"/>
            <edc:SFRFieldDef edc:cname="RXIDLEV" edc:nzwidth="0x1" edc:desc="Receiver Idle Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM2" edc:cname="FLEX_US_LINMR" edc:nzwidth="0x20" edc:access="--------------nnnnnnnnnnnnnnnnnn" edc:impl="0x3FFFF" edc:_addr="0x40008254">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM2">
            <edc:SFRFieldDef edc:cname="NACT" edc:nzwidth="0x2" edc:desc="LIN Node Action">
              <edc:SFRFieldSemantic edc:cname="PUBLISH" edc:desc="The USART transmits the response." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SUBSCRIBE" edc:desc="The USART receives the response." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IGNORE" edc:desc="The USART does not transmit and does not receive the response." edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PARDIS" edc:nzwidth="0x1" edc:desc="Parity Disable"/>
            <edc:SFRFieldDef edc:cname="CHKDIS" edc:nzwidth="0x1" edc:desc="Checksum Disable"/>
            <edc:SFRFieldDef edc:cname="CHKTYP" edc:nzwidth="0x1" edc:desc="Checksum Type"/>
            <edc:SFRFieldDef edc:cname="DLM" edc:nzwidth="0x1" edc:desc="Data Length Mode"/>
            <edc:SFRFieldDef edc:cname="FSDIS" edc:nzwidth="0x1" edc:desc="Frame Slot Mode Disable"/>
            <edc:SFRFieldDef edc:cname="WKUPTYP" edc:nzwidth="0x1" edc:desc="Wakeup Signal Type"/>
            <edc:SFRFieldDef edc:cname="DLC" edc:nzwidth="0x8" edc:desc="Data Length Control"/>
            <edc:SFRFieldDef edc:cname="PDCM" edc:nzwidth="0x1" edc:desc="PDC Mode"/>
            <edc:SFRFieldDef edc:cname="SYNCDIS" edc:nzwidth="0x1" edc:desc="Synchronization Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM2" edc:cname="FLEX_US_LINIR" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x40008258">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM2">
            <edc:SFRFieldDef edc:cname="IDCHR" edc:nzwidth="0x8" edc:desc="Identifier Character"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM2" edc:cname="FLEX_US_LINBRR" edc:nzwidth="0x20" edc:access="-------------rrrrrrrrrrrrrrrrrrr" edc:impl="0x7FFFF" edc:_addr="0x4000825C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM2">
            <edc:SFRFieldDef edc:cname="LINCD" edc:nzwidth="0x10" edc:desc="Clock Divider after Synchronization"/>
            <edc:SFRFieldDef edc:cname="LINFP" edc:nzwidth="0x3" edc:desc="Fractional Part after Synchronization"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
