Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/edc/PIC32CX5112MTSH128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM6" edc:cname="FLEX_US_FIER" edc:nzwidth="0x20" edc:access="----------------------w-wwwwwwww" edc:impl="0x2FF" edc:_addr="0x400182A8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM6">
            <edc:SFRFieldDef edc:cname="TXFEF" edc:nzwidth="0x1" edc:desc="TXFEF Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXFFF" edc:nzwidth="0x1" edc:desc="TXFFF Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXFTHF" edc:nzwidth="0x1" edc:desc="TXFTHF Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXFEF" edc:nzwidth="0x1" edc:desc="RXFEF Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXFFF" edc:nzwidth="0x1" edc:desc="RXFFF Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXFTHF" edc:nzwidth="0x1" edc:desc="RXFTHF Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXFPTEF" edc:nzwidth="0x1" edc:desc="TXFPTEF Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXFPTEF" edc:nzwidth="0x1" edc:desc="RXFPTEF Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RXFTHF2" edc:nzwidth="0x1" edc:desc="RXFTHF2 Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM6" edc:cname="FLEX_US_FIDR" edc:nzwidth="0x20" edc:access="----------------------w-wwwwwwww" edc:impl="0x2FF" edc:_addr="0x400182AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM6">
            <edc:SFRFieldDef edc:cname="TXFEF" edc:nzwidth="0x1" edc:desc="TXFEF Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXFFF" edc:nzwidth="0x1" edc:desc="TXFFF Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXFTHF" edc:nzwidth="0x1" edc:desc="TXFTHF Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXFEF" edc:nzwidth="0x1" edc:desc="RXFEF Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXFFF" edc:nzwidth="0x1" edc:desc="RXFFF Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXFTHF" edc:nzwidth="0x1" edc:desc="RXFTHF Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXFPTEF" edc:nzwidth="0x1" edc:desc="TXFPTEF Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXFPTEF" edc:nzwidth="0x1" edc:desc="RXFPTEF Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RXFTHF2" edc:nzwidth="0x1" edc:desc="RXFTHF2 Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM6" edc:cname="FLEX_US_FIMR" edc:nzwidth="0x20" edc:access="----------------------r-rrrrrrrr" edc:impl="0x2FF" edc:_addr="0x400182B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM6">
            <edc:SFRFieldDef edc:cname="TXFEF" edc:nzwidth="0x1" edc:desc="TXFEF Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXFFF" edc:nzwidth="0x1" edc:desc="TXFFF Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXFTHF" edc:nzwidth="0x1" edc:desc="TXFTHF Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXFEF" edc:nzwidth="0x1" edc:desc="RXFEF Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXFFF" edc:nzwidth="0x1" edc:desc="RXFFF Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXFTHF" edc:nzwidth="0x1" edc:desc="RXFTHF Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXFPTEF" edc:nzwidth="0x1" edc:desc="TXFPTEF Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXFPTEF" edc:nzwidth="0x1" edc:desc="RXFPTEF Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RXFTHF2" edc:nzwidth="0x1" edc:desc="RXFTHF2 Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM6" edc:cname="FLEX_US_FESR" edc:nzwidth="0x20" edc:access="----------------------rrrrrrrrrr" edc:impl="0x3FF" edc:_addr="0x400182B4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM6">
            <edc:SFRFieldDef edc:cname="TXFEF" edc:nzwidth="0x1" edc:desc="Transmit FIFO Empty Flag (cleared by writing the FLEX_US_CR.RSTSTA bit)"/>
            <edc:SFRFieldDef edc:cname="TXFFF" edc:nzwidth="0x1" edc:desc="Transmit FIFO Full Flag (cleared by writing the FLEX_US_CR.RSTSTA bit)"/>
            <edc:SFRFieldDef edc:cname="TXFTHF" edc:nzwidth="0x1" edc:desc="Transmit FIFO Threshold Flag (cleared by writing the FLEX_US_CR.RSTSTA bit)"/>
            <edc:SFRFieldDef edc:cname="RXFEF" edc:nzwidth="0x1" edc:desc="Receive FIFO Empty Flag (cleared by writing the FLEX_US_CR.RSTSTA bit)"/>
            <edc:SFRFieldDef edc:cname="RXFFF" edc:nzwidth="0x1" edc:desc="Receive FIFO Full Flag (cleared by writing the FLEX_US_CR.RSTSTA bit)"/>
            <edc:SFRFieldDef edc:cname="RXFTHF" edc:nzwidth="0x1" edc:desc="Receive FIFO Threshold Flag (cleared by writing the FLEX_US_CR.RSTSTA bit)"/>
            <edc:SFRFieldDef edc:cname="TXFPTEF" edc:nzwidth="0x1" edc:desc="Transmit FIFO Pointer Error Flag"/>
            <edc:SFRFieldDef edc:cname="RXFPTEF" edc:nzwidth="0x1" edc:desc="Receive FIFO Pointer Error Flag"/>
            <edc:SFRFieldDef edc:cname="TXFLOCK" edc:nzwidth="0x1" edc:desc="Transmit FIFO Lock"/>
            <edc:SFRFieldDef edc:cname="RXFTHF2" edc:nzwidth="0x1" edc:desc="Receive FIFO Threshold Flag 2 (cleared by writing the FLEX_US_CR.RSTSTA bit)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2C" edc:_addr="0x400182B8"/>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM6" edc:cname="FLEX_US_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-----nnn" edc:impl="0xFFFFFF07" edc:_addr="0x400182E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM6">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:SFRFieldDef edc:cname="WPITEN" edc:nzwidth="0x1" edc:desc="Write Protection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="WPCREN" edc:nzwidth="0x1" edc:desc="Write Protection Control Enable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of bits WPEN, WPITEN and WPCREN. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x555341"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM6" edc:cname="FLEX_US_WPSR" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:impl="0xFFFF01" edc:_addr="0x400182E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM6">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protection Violation Status"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x10" edc:desc="Write Protection Violation Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x114" edc:_addr="0x400182EC"/>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM6" edc:cname="FLEX_SPI_CR" edc:nzwidth="0x20" edc:access="ww-----w------ww---w----w-----ww" edc:impl="0xC1031083" edc:_addr="0x40018400">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM6">
            <edc:SFRFieldDef edc:cname="SPIEN" edc:nzwidth="0x1" edc:desc="SPI Enable"/>
            <edc:SFRFieldDef edc:cname="SPIDIS" edc:nzwidth="0x1" edc:desc="SPI Disable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="SPI Software Reset"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="REQCLR" edc:nzwidth="0x1" edc:desc="Request to Clear the Comparison Trigger"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TXFCLR" edc:nzwidth="0x1" edc:desc="Transmit FIFO Clear"/>
            <edc:SFRFieldDef edc:cname="RXFCLR" edc:nzwidth="0x1" edc:desc="Receive FIFO Clear"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="LASTXFER" edc:nzwidth="0x1" edc:desc="Last Transfer"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="FIFOEN" edc:nzwidth="0x1" edc:desc="FIFO Enable"/>
            <edc:SFRFieldDef edc:cname="FIFODIS" edc:nzwidth="0x1" edc:desc="FIFO Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM6" edc:cname="FLEX_SPI_MR" edc:nzwidth="0x20" edc:access="nnnnnnnn------nn---n----n-nnnnnn" edc:impl="0xFF0310BF" edc:_addr="0x40018404">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM6">
            <edc:SFRFieldDef edc:cname="MSTR" edc:nzwidth="0x1" edc:desc="Host/Client Mode"/>
            <edc:SFRFieldDef edc:cname="PS" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="PCSDEC" edc:nzwidth="0x1" edc:desc="Chip Select Decode"/>
            <edc:SFRFieldDef edc:cname="BRSRCCLK" edc:nzwidth="0x1" edc:desc="Bit Rate Source Clock">
              <edc:SFRFieldSemantic edc:cname="PERIPH_CLK" edc:desc="The peripheral clock is the source clock for the bit rate generation." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="GCLK" edc:desc="GCLK is the source clock for the bit rate generation, thus the bit rate can be independent of the core/peripheral clock." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MODFDIS" edc:nzwidth="0x1" edc:desc="Mode Fault Detection"/>
            <edc:SFRFieldDef edc:cname="WDRBT" edc:nzwidth="0x1" edc:desc="Wait Data Read Before Transfer"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LLB" edc:nzwidth="0x1" edc:desc="Local Loopback Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CMPMODE" edc:nzwidth="0x1" edc:desc="Comparison Mode">
              <edc:SFRFieldSemantic edc:cname="FLAG_ONLY" edc:desc="Any character is received and comparison function drives CMP flag." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="START_CONDITION" edc:desc="Comparison condition must be met to start reception of all incoming characters until REQCLR is set." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PCS" edc:nzwidth="0x2" edc:desc="Peripheral Chip Select"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="DLYBCS" edc:nzwidth="0x8" edc:desc="Delay Between Chip Selects"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
