Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/edc/PIC32CX5112MTSH128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="IPC0" edc:cname="IPC0_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn------n-" edc:impl="0xFFFFFF02" edc:_addr="0x4002C01C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IPC0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WPITEN" edc:nzwidth="0x1" edc:desc="Write Protection Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x495043"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3FE0" edc:_addr="0x4002C020"/>
      <edc:SFRDef ltx:memberofperipheral="SLCDC" edc:cname="SLCDC_CR" edc:nzwidth="0x20" edc:access="----------------wwwwwwwwww--w-ww" edc:impl="0xFFCB" edc:_addr="0x40030000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCDC">
            <edc:SFRFieldDef edc:cname="LCDEN" edc:nzwidth="0x1" edc:desc="Enable the LCDC"/>
            <edc:SFRFieldDef edc:cname="LCDDIS" edc:nzwidth="0x1" edc:desc="Disable LCDC"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FRZDF" edc:nzwidth="0x1" edc:desc="Freeze Display Panel Features Configuration"/>
            <edc:SFRFieldDef edc:cname="FRZMAP" edc:nzwidth="0x1" edc:desc="Freeze Remap Configuration"/>
            <edc:SFRFieldDef edc:cname="FRZKEY" edc:nzwidth="0x8" edc:desc="Freeze Key (write-only)">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the FRZDF bit or FRZMAP bit. Always reads as 0." edc:when="(field &amp; 0xFF) == 0x4E"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SLCDC" edc:cname="SLCDC_MR" edc:nzwidth="0x20" edc:access="-------n--nnnnnn--nnnnnn-----nnn" edc:impl="0x13F3F07" edc:_addr="0x40030004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCDC">
            <edc:SFRFieldDef edc:cname="COMSEL" edc:nzwidth="0x3" edc:desc="Selection of the Number of Commons">
              <edc:SFRFieldSemantic edc:cname="COM_0" edc:desc="COM0 is driven by SLCDC, COM1:7 are driven by digital function" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="COM_0TO1" edc:desc="COM0:1 are driven by SLCDC, COM2:7 are driven by digital function" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="COM_0TO2" edc:desc="COM0:2 are driven by SLCDC, COM3:7 are driven by digital function" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="COM_0TO3" edc:desc="COM0:3 are driven by SLCDC, COM4:7 are driven by digital function" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="COM_0TO4" edc:desc="COM0:4 are driven by SLCDC, COM5:7 are driven by digital function" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="COM_0TO5" edc:desc="COM0:5 are driven by SLCDC, COM6:7 are driven by digital function" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="COM_0TO6" edc:desc="COM0:6 are driven by SLCDC, COM7 driven by digital function" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="COM_0TO7" edc:desc="COM0:7 are driven by SLCDC, no COM pin driven by digital function" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SEGSEL" edc:nzwidth="0x6" edc:desc="Selection of the Number of Segments"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="BUFTIME" edc:nzwidth="0x4" edc:desc="Buffer On-Time">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Nominal drive time is 0% of SLCK period" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="X2_SLCK_PERIOD" edc:desc="Nominal drive time is 2 periods of SLCK clock" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="X4_SLCK_PERIOD" edc:desc="Nominal drive time is 4 periods of SLCK clock" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="X8_SLCK_PERIOD" edc:desc="Nominal drive time is 8 periods of SLCK clock" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="X16_SLCK_PERIOD" edc:desc="Nominal drive time is 16 periods of SLCK clock" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="X32_SLCK_PERIOD" edc:desc="Nominal drive time is 32 periods of SLCK clock" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="X64_SLCK_PERIOD" edc:desc="Nominal drive time is 64 periods of SLCK clock" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="X128_SLCK_PERIOD" edc:desc="Nominal drive time is 128 periods of SLCK clock" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="PERCENT_50" edc:desc="Nominal drive time is 50% of SLCK period" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="PERCENT_100" edc:desc="Nominal drive time is 100% of SLCK period" edc:when="(field &amp; 0xF) == 0x9"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BIAS" edc:nzwidth="0x2" edc:desc="LCD Display Configuration">
              <edc:SFRFieldSemantic edc:cname="STATIC" edc:desc="Static" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BIAS_1_2" edc:desc="Bias 1/2" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BIAS_1_3" edc:desc="Bias 1/3" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="BIAS_1_4" edc:desc="Bias 1/4" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LPMODE" edc:nzwidth="0x1" edc:desc="Low-Power Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
