Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/edc/PIC32CX5112MTSH128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_PSR15" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4004423C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="LAUSERH0" edc:nzwidth="0x1" edc:desc="Low Area USER in HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="LAUSERH1" edc:nzwidth="0x1" edc:desc="Low Area USER in HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="LAUSERH2" edc:nzwidth="0x1" edc:desc="Low Area USER in HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="LAUSERH3" edc:nzwidth="0x1" edc:desc="Low Area USER in HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="LAUSERH4" edc:nzwidth="0x1" edc:desc="Low Area USER in HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="LAUSERH5" edc:nzwidth="0x1" edc:desc="Low Area USER in HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="LAUSERH6" edc:nzwidth="0x1" edc:desc="Low Area USER in HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="LAUSERH7" edc:nzwidth="0x1" edc:desc="Low Area USER in HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="RDUSERH0" edc:nzwidth="0x1" edc:desc="Read USER for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="RDUSERH1" edc:nzwidth="0x1" edc:desc="Read USER for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="RDUSERH2" edc:nzwidth="0x1" edc:desc="Read USER for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="RDUSERH3" edc:nzwidth="0x1" edc:desc="Read USER for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="RDUSERH4" edc:nzwidth="0x1" edc:desc="Read USER for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="RDUSERH5" edc:nzwidth="0x1" edc:desc="Read USER for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="RDUSERH6" edc:nzwidth="0x1" edc:desc="Read USER for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="RDUSERH7" edc:nzwidth="0x1" edc:desc="Read USER for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="WRUSERH0" edc:nzwidth="0x1" edc:desc="Write USER for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="WRUSERH1" edc:nzwidth="0x1" edc:desc="Write USER for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="WRUSERH2" edc:nzwidth="0x1" edc:desc="Write USER for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="WRUSERH3" edc:nzwidth="0x1" edc:desc="Write USER for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="WRUSERH4" edc:nzwidth="0x1" edc:desc="Write USER for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="WRUSERH5" edc:nzwidth="0x1" edc:desc="Write USER for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="WRUSERH6" edc:nzwidth="0x1" edc:desc="Write USER for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="WRUSERH7" edc:nzwidth="0x1" edc:desc="Write USER for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="DPSOA0" edc:nzwidth="0x1" edc:desc="Downward Protection Split Address for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="DPSOA1" edc:nzwidth="0x1" edc:desc="Downward Protection Split Address for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="DPSOA2" edc:nzwidth="0x1" edc:desc="Downward Protection Split Address for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="DPSOA3" edc:nzwidth="0x1" edc:desc="Downward Protection Split Address for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="DPSOA4" edc:nzwidth="0x1" edc:desc="Downward Protection Split Address for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="DPSOA5" edc:nzwidth="0x1" edc:desc="Downward Protection Split Address for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="DPSOA6" edc:nzwidth="0x1" edc:desc="Downward Protection Split Address for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="DPSOA7" edc:nzwidth="0x1" edc:desc="Downward Protection Split Address for HSELx Protected Region"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_PASSR0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40044240">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="PASPLIT0" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT1" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT2" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT3" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT4" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT5" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT6" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT7" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_PASSR1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40044244">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="PASPLIT0" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT1" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT2" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT3" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT4" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT5" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT6" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT7" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_PASSR2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40044248">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="PASPLIT0" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT1" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT2" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT3" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT4" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT5" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT6" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT7" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
