Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/edc/PIC32CX5112MTSH128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="PIO0" edc:cname="PIO_P2PIO0_P_SIO_PAR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x400490B4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIO0">
            <edc:SFRFieldDef edc:cname="P0" edc:nzwidth="0x1" edc:desc="Set I/O in Privileged-Access mode"/>
            <edc:SFRFieldDef edc:cname="P1" edc:nzwidth="0x1" edc:desc="Set I/O in Privileged-Access mode"/>
            <edc:SFRFieldDef edc:cname="P2" edc:nzwidth="0x1" edc:desc="Set I/O in Privileged-Access mode"/>
            <edc:SFRFieldDef edc:cname="P3" edc:nzwidth="0x1" edc:desc="Set I/O in Privileged-Access mode"/>
            <edc:SFRFieldDef edc:cname="P4" edc:nzwidth="0x1" edc:desc="Set I/O in Privileged-Access mode"/>
            <edc:SFRFieldDef edc:cname="P5" edc:nzwidth="0x1" edc:desc="Set I/O in Privileged-Access mode"/>
            <edc:SFRFieldDef edc:cname="P6" edc:nzwidth="0x1" edc:desc="Set I/O in Privileged-Access mode"/>
            <edc:SFRFieldDef edc:cname="P7" edc:nzwidth="0x1" edc:desc="Set I/O in Privileged-Access mode"/>
            <edc:SFRFieldDef edc:cname="P8" edc:nzwidth="0x1" edc:desc="Set I/O in Privileged-Access mode"/>
            <edc:SFRFieldDef edc:cname="P9" edc:nzwidth="0x1" edc:desc="Set I/O in Privileged-Access mode"/>
            <edc:SFRFieldDef edc:cname="P10" edc:nzwidth="0x1" edc:desc="Set I/O in Privileged-Access mode"/>
            <edc:SFRFieldDef edc:cname="P11" edc:nzwidth="0x1" edc:desc="Set I/O in Privileged-Access mode"/>
            <edc:SFRFieldDef edc:cname="P12" edc:nzwidth="0x1" edc:desc="Set I/O in Privileged-Access mode"/>
            <edc:SFRFieldDef edc:cname="P13" edc:nzwidth="0x1" edc:desc="Set I/O in Privileged-Access mode"/>
            <edc:SFRFieldDef edc:cname="P14" edc:nzwidth="0x1" edc:desc="Set I/O in Privileged-Access mode"/>
            <edc:SFRFieldDef edc:cname="P15" edc:nzwidth="0x1" edc:desc="Set I/O in Privileged-Access mode"/>
            <edc:SFRFieldDef edc:cname="P16" edc:nzwidth="0x1" edc:desc="Set I/O in Privileged-Access mode"/>
            <edc:SFRFieldDef edc:cname="P17" edc:nzwidth="0x1" edc:desc="Set I/O in Privileged-Access mode"/>
            <edc:SFRFieldDef edc:cname="P18" edc:nzwidth="0x1" edc:desc="Set I/O in Privileged-Access mode"/>
            <edc:SFRFieldDef edc:cname="P19" edc:nzwidth="0x1" edc:desc="Set I/O in Privileged-Access mode"/>
            <edc:SFRFieldDef edc:cname="P20" edc:nzwidth="0x1" edc:desc="Set I/O in Privileged-Access mode"/>
            <edc:SFRFieldDef edc:cname="P21" edc:nzwidth="0x1" edc:desc="Set I/O in Privileged-Access mode"/>
            <edc:SFRFieldDef edc:cname="P22" edc:nzwidth="0x1" edc:desc="Set I/O in Privileged-Access mode"/>
            <edc:SFRFieldDef edc:cname="P23" edc:nzwidth="0x1" edc:desc="Set I/O in Privileged-Access mode"/>
            <edc:SFRFieldDef edc:cname="P24" edc:nzwidth="0x1" edc:desc="Set I/O in Privileged-Access mode"/>
            <edc:SFRFieldDef edc:cname="P25" edc:nzwidth="0x1" edc:desc="Set I/O in Privileged-Access mode"/>
            <edc:SFRFieldDef edc:cname="P26" edc:nzwidth="0x1" edc:desc="Set I/O in Privileged-Access mode"/>
            <edc:SFRFieldDef edc:cname="P27" edc:nzwidth="0x1" edc:desc="Set I/O in Privileged-Access mode"/>
            <edc:SFRFieldDef edc:cname="P28" edc:nzwidth="0x1" edc:desc="Set I/O in Privileged-Access mode"/>
            <edc:SFRFieldDef edc:cname="P29" edc:nzwidth="0x1" edc:desc="Set I/O in Privileged-Access mode"/>
            <edc:SFRFieldDef edc:cname="P30" edc:nzwidth="0x1" edc:desc="Set I/O in Privileged-Access mode"/>
            <edc:SFRFieldDef edc:cname="P31" edc:nzwidth="0x1" edc:desc="Set I/O in Privileged-Access mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PIO0" edc:cname="PIO_P2PIO0_P_IOSSR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x400490B8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIO0">
            <edc:SFRFieldDef edc:cname="P0" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P1" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P2" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P3" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P4" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P5" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P6" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P7" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P8" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P9" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P10" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P11" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P12" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P13" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P14" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P15" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P16" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P17" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P18" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P19" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P20" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P21" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P22" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P23" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P24" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P25" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P26" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P27" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P28" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P29" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P30" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="P31" edc:nzwidth="0x1" edc:desc="I/O Security Status">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED_ACCESS" edc:desc="The I/O line of the I/O group 0 is in Privileged-Access mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="USER_ACCESS" edc:desc="The I/O line of the I/O group 0 is in User-Access mode." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PIO0" edc:cname="PIO_P2PIO0_P_IOFR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwww------ww" edc:impl="0xFFFFFF03" edc:_addr="0x400490BC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIO0">
            <edc:SFRFieldDef edc:cname="FPHY" edc:nzwidth="0x1" edc:desc="Freeze Physical Configuration"/>
            <edc:SFRFieldDef edc:cname="FINT" edc:nzwidth="0x1" edc:desc="Freeze Interrupt Configuration"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="FRZKEY" edc:nzwidth="0x18" edc:desc="Freeze Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit." edc:when="(field &amp; 0xFFFFFF) == 0x494F46"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x440" edc:_addr="0x400490C0"/>
      <edc:SFRDef ltx:memberofperipheral="PIO0" edc:cname="PIO0_P_SCDR" edc:nzwidth="0x20" edc:access="------------------nnnnnnnnnnnnnn" edc:impl="0x3FFF" edc:_addr="0x40049500">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIO0">
            <edc:SFRFieldDef edc:cname="DIV" edc:nzwidth="0xE" edc:desc="Slow Clock Divider Selection for Debouncing"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xDC" edc:_addr="0x40049504"/>
      <edc:SFRDef ltx:memberofperipheral="PIO0" edc:cname="PIO0_P_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn------nn" edc:impl="0xFFFFFF03" edc:_addr="0x400495E0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIO0">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:SFRFieldDef edc:cname="WPITEN" edc:nzwidth="0x1" edc:desc="Write Protection Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of WPEN. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x50494F"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PIO0" edc:cname="PIO0_P_WPSR" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:impl="0xFFFF01" edc:_addr="0x400495E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIO0">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protection Violation Status"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x10" edc:desc="Write Protection Violation Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
