Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/edc/PIC32CX5112MTSH128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="DWDT" edc:cname="WDT1_IER" edc:nzwidth="0x20" edc:access="--------------------------w--www" edc:impl="0x27" edc:_addr="0x40052014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWDT">
            <edc:SFRFieldDef edc:cname="PERINT" edc:nzwidth="0x1" edc:desc="Overflow Period Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RPTHINT" edc:nzwidth="0x1" edc:desc="Reload Repeat Period Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LVLINT" edc:nzwidth="0x1" edc:desc="Interrupt Level Threshold Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RLDERR" edc:nzwidth="0x1" edc:desc="Reload Command Error Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWDT" edc:cname="WDT1_IDR" edc:nzwidth="0x20" edc:access="--------------------------w--www" edc:impl="0x27" edc:_addr="0x40052018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWDT">
            <edc:SFRFieldDef edc:cname="PERINT" edc:nzwidth="0x1" edc:desc="Overflow Period Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RPTHINT" edc:nzwidth="0x1" edc:desc="Reload Repeat Period Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LVLINT" edc:nzwidth="0x1" edc:desc="Interrupt Level Threshold Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RLDERR" edc:nzwidth="0x1" edc:desc="Reload Command Error Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWDT" edc:cname="WDT1_ISR" edc:nzwidth="0x20" edc:access="--------------------------r--rrr" edc:impl="0x27" edc:_addr="0x4005201C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWDT">
            <edc:SFRFieldDef edc:cname="PERINT" edc:nzwidth="0x1" edc:desc="Overflow Period Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="RPTHINT" edc:nzwidth="0x1" edc:desc="Reload Repeat Period Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="LVLINT" edc:nzwidth="0x1" edc:desc="Interrupt Level Threshold Status (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RLDERR" edc:nzwidth="0x1" edc:desc="Reload Command Error Status (cleared on read)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWDT" edc:cname="WDT1_IMR" edc:nzwidth="0x20" edc:access="--------------------------r--rrr" edc:impl="0x27" edc:_addr="0x40052020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWDT">
            <edc:SFRFieldDef edc:cname="PERINT" edc:nzwidth="0x1" edc:desc="Overflow Period Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RPTHINT" edc:nzwidth="0x1" edc:desc="Reload Repeat Period Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LVLINT" edc:nzwidth="0x1" edc:desc="Interrupt Level Threshold Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RLDERR" edc:nzwidth="0x1" edc:desc="Reload Command Error Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xFDC" edc:_addr="0x40052024"/>
      <edc:SFRDef ltx:memberofperipheral="RSTC" edc:cname="RSTC_CR" edc:nzwidth="0x20" edc:access="wwwwwwww--------------------ww-w" edc:impl="0xFF00000D" edc:_addr="0x40053000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RSTC">
            <edc:SFRFieldDef edc:cname="PROCRST" edc:nzwidth="0x1" edc:desc="Processor Reset"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PERRST" edc:nzwidth="0x1" edc:desc="Peripheral Reset"/>
            <edc:SFRFieldDef edc:cname="EXTRST" edc:nzwidth="0x1" edc:desc="External Reset"/>
            <edc:AdjustPoint edc:offset="0x14"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x8" edc:desc="System Reset Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation." edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RSTC" edc:cname="RSTC_SR" edc:nzwidth="0x20" edc:access="--------------rr----rrrr------rr" edc:impl="0x30F03" edc:_addr="0x40053004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RSTC">
            <edc:SFRFieldDef edc:cname="URSTS" edc:nzwidth="0x1" edc:desc="User Reset Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="CORESMS" edc:nzwidth="0x1" edc:desc="VDDCORE Supply Monitor Reset Flag Status (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="RSTTYP" edc:nzwidth="0x4" edc:desc="Reset Type">
              <edc:SFRFieldSemantic edc:cname="GENERAL_RST" edc:desc="First power-up reset, Core and VDD3V3 Supply Monitor if not a PORVDD3V3 reset" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BACKUP_RST" edc:desc="VDDCORE reset. Wake-up from Backup mode" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="WDT0_RST" edc:desc="Watchdog 0 fault occurred" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="SOFT_RST" edc:desc="Processor reset required by the software" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="USER_RST" edc:desc="NRST pin detected low" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="CORE_SM_RST" edc:desc="Core Supply Monitor reset" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="CPU_FAIL_RST" edc:desc="CPU clock failure detection occurred" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="SLCK_XTAL_RST" edc:desc="32.768 kHz crystal failure detection fault occurred" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="WDT1_RST" edc:desc="Watchdog 1 fault occurred" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="PORVDD3V3_RST" edc:desc="VDD3V3 PORVDD3V3 reset occurred" edc:when="(field &amp; 0xF) == 0xA"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NRSTL" edc:nzwidth="0x1" edc:desc="NRST Pin Level"/>
            <edc:SFRFieldDef edc:cname="SRCMP" edc:nzwidth="0x1" edc:desc="Software Reset Command in Progress"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RSTC" edc:cname="RSTC_MR" edc:nzwidth="0x20" edc:access="nnnnnnnn-nn--nnn----nnnnnnnnnnnn" edc:por="00000000000000000000000011110101" edc:mclr="00000000000000000000000011110101" edc:impl="0xFF670FFF" edc:_addr="0x40053008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RSTC">
            <edc:SFRFieldDef edc:cname="URSTEN" edc:nzwidth="0x1" edc:desc="User Reset Enable"/>
            <edc:SFRFieldDef edc:cname="SCKSW" edc:nzwidth="0x1" edc:desc="Slow Clock Switching"/>
            <edc:SFRFieldDef edc:cname="URSTASYNC" edc:nzwidth="0x1" edc:desc="User Reset Asynchronous Control"/>
            <edc:SFRFieldDef edc:cname="CPUFEN" edc:nzwidth="0x1" edc:desc="CPU Fail Enable"/>
            <edc:SFRFieldDef edc:cname="URSTIEN" edc:nzwidth="0x1" edc:desc="User Reset Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SFTPMCRS" edc:nzwidth="0x1" edc:desc="Software PMC Reset"/>
            <edc:SFRFieldDef edc:cname="WDTPMC0" edc:nzwidth="0x1" edc:desc="WDT0 PMC Reset"/>
            <edc:SFRFieldDef edc:cname="WDTPMC1" edc:nzwidth="0x1" edc:desc="WDT1 PMC Reset"/>
            <edc:SFRFieldDef edc:cname="ERSTL" edc:nzwidth="0x4" edc:desc="External Reset Length"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CORSMIEN" edc:nzwidth="0x1" edc:desc="VDDCORE Supply Monitor Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CPEREN" edc:nzwidth="0x1" edc:desc="Coprocessor Peripheral Enable"/>
            <edc:SFRFieldDef edc:cname="CPROCEN" edc:nzwidth="0x1" edc:desc="Coprocessor (Second Processor) Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PWRSW" edc:nzwidth="0x1" edc:desc="Backup Area Power Switch Control">
              <edc:SFRFieldSemantic edc:cname="VDD3V3" edc:desc="VDDBU is supplied by VDD3V3" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="VBAT" edc:desc="VDDBU is supplied by VBAT" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BADXTRST" edc:nzwidth="0x1" edc:desc="Bad XTAL Fail Reset"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x8" edc:desc="Write Access Password">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation. Always reads as 0." edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
