Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/edc/PIC32CX5112MTSH128S1.PIC
      <edc:AdjustPoint edc:offset="0x14" edc:_addr="0x4005300C"/>
      <edc:SFRDef ltx:memberofperipheral="RTT" edc:cname="RTT_MR" edc:nzwidth="0x20" edc:access="-------n--nn-nnnnnnnnnnnnnnnnnnn" edc:impl="0x137FFFF" edc:_addr="0x40053020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTT">
            <edc:SFRFieldDef edc:cname="RTPRES" edc:nzwidth="0x10" edc:desc="Real-time Timer Prescaler Value"/>
            <edc:SFRFieldDef edc:cname="ALMIEN" edc:nzwidth="0x1" edc:desc="Alarm Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RTTINCIEN" edc:nzwidth="0x1" edc:desc="Real-time Timer Increment Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RTTRST" edc:nzwidth="0x1" edc:desc="Real-time Timer Restart"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RTTDIS" edc:nzwidth="0x1" edc:desc="Real-time Timer Disable"/>
            <edc:SFRFieldDef edc:cname="INC2AEN" edc:nzwidth="0x1" edc:desc="RTTINC2 Alarm and Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RTC1HZ" edc:nzwidth="0x1" edc:desc="Real-Time Clock 1Hz Clock Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTT" edc:cname="RTT_AR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40053024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTT">
            <edc:SFRFieldDef edc:cname="ALMV" edc:nzwidth="0x20" edc:desc="Alarm Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTT" edc:cname="RTT_VR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40053028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTT">
            <edc:SFRFieldDef edc:cname="CRTV" edc:nzwidth="0x20" edc:desc="Current Real-time Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTT" edc:cname="RTT_SR" edc:nzwidth="0x20" edc:access="-----------------------------rrr" edc:impl="0x7" edc:_addr="0x4005302C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTT">
            <edc:SFRFieldDef edc:cname="ALMS" edc:nzwidth="0x1" edc:desc="Real-time Alarm Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="RTTINC" edc:nzwidth="0x1" edc:desc="Prescaler Roll-over Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="RTTINC2" edc:nzwidth="0x1" edc:desc="Predefined Number of Prescaler Roll-overs Status (cleared on read)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTT" edc:cname="RTT_MODR" edc:nzwidth="0x20" edc:access="-----------------------------nnn" edc:impl="0x7" edc:_addr="0x40053030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTT">
            <edc:SFRFieldDef edc:cname="SELINC2" edc:nzwidth="0x3" edc:desc="Selection of the 32-bit Counter Modulo to generate RTTINC2 Flag">
              <edc:SFRFieldSemantic edc:cname="NO_RTTINC2" edc:desc="The RTTINC2 flag never rises" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MOD64" edc:desc="The RTTINC2 flag is set when CRTV modulo 64 equals 0" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MOD128" edc:desc="The RTTINC2 flag is set when CRTV modulo 128 equals 0" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MOD256" edc:desc="The RTTINC2 flag is set when CRTV modulo 256 equals 0" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="MOD512" edc:desc="The RTTINC2 flag is set when CRTV modulo 512 equals 0" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="MOD1024" edc:desc="The RTTINC2 flag is set when CRTV modulo 1024 equals 0. Example: If RTPRES=32 then RTTINC2 flag rises once per second if the slow clock is 32.768 kHz." edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="MOD2048" edc:desc="The RTTINC2 flag is set when CRTV modulo 2048 equals 0" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="MOD4096" edc:desc="The RTTINC2 flag is set when CRTV modulo 4096 equals 0" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2C" edc:_addr="0x40053034"/>
      <edc:SFRDef ltx:memberofperipheral="GPBR" edc:cname="GPBR_MR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40053060">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPBR">
            <edc:SFRFieldDef edc:cname="GPBRWP0" edc:nzwidth="0x1" edc:desc="GPBRx Write Protection"/>
            <edc:SFRFieldDef edc:cname="GPBRWP1" edc:nzwidth="0x1" edc:desc="GPBRx Write Protection"/>
            <edc:SFRFieldDef edc:cname="GPBRWP2" edc:nzwidth="0x1" edc:desc="GPBRx Write Protection"/>
            <edc:SFRFieldDef edc:cname="GPBRWP3" edc:nzwidth="0x1" edc:desc="GPBRx Write Protection"/>
            <edc:SFRFieldDef edc:cname="GPBRWP4" edc:nzwidth="0x1" edc:desc="GPBRx Write Protection"/>
            <edc:SFRFieldDef edc:cname="GPBRWP5" edc:nzwidth="0x1" edc:desc="GPBRx Write Protection"/>
            <edc:SFRFieldDef edc:cname="GPBRWP6" edc:nzwidth="0x1" edc:desc="GPBRx Write Protection"/>
            <edc:SFRFieldDef edc:cname="GPBRWP7" edc:nzwidth="0x1" edc:desc="GPBRx Write Protection"/>
            <edc:SFRFieldDef edc:cname="GPBRWP8" edc:nzwidth="0x1" edc:desc="GPBRx Write Protection"/>
            <edc:SFRFieldDef edc:cname="GPBRWP9" edc:nzwidth="0x1" edc:desc="GPBRx Write Protection"/>
            <edc:SFRFieldDef edc:cname="GPBRWP10" edc:nzwidth="0x1" edc:desc="GPBRx Write Protection"/>
            <edc:SFRFieldDef edc:cname="GPBRWP11" edc:nzwidth="0x1" edc:desc="GPBRx Write Protection"/>
            <edc:SFRFieldDef edc:cname="GPBRWP12" edc:nzwidth="0x1" edc:desc="GPBRx Write Protection"/>
            <edc:SFRFieldDef edc:cname="GPBRWP13" edc:nzwidth="0x1" edc:desc="GPBRx Write Protection"/>
            <edc:SFRFieldDef edc:cname="GPBRWP14" edc:nzwidth="0x1" edc:desc="GPBRx Write Protection"/>
            <edc:SFRFieldDef edc:cname="GPBRWP15" edc:nzwidth="0x1" edc:desc="GPBRx Write Protection"/>
            <edc:SFRFieldDef edc:cname="GPBRRP0" edc:nzwidth="0x1" edc:desc="GPBRx Read Protection"/>
            <edc:SFRFieldDef edc:cname="GPBRRP1" edc:nzwidth="0x1" edc:desc="GPBRx Read Protection"/>
            <edc:SFRFieldDef edc:cname="GPBRRP2" edc:nzwidth="0x1" edc:desc="GPBRx Read Protection"/>
            <edc:SFRFieldDef edc:cname="GPBRRP3" edc:nzwidth="0x1" edc:desc="GPBRx Read Protection"/>
            <edc:SFRFieldDef edc:cname="GPBRRP4" edc:nzwidth="0x1" edc:desc="GPBRx Read Protection"/>
            <edc:SFRFieldDef edc:cname="GPBRRP5" edc:nzwidth="0x1" edc:desc="GPBRx Read Protection"/>
            <edc:SFRFieldDef edc:cname="GPBRRP6" edc:nzwidth="0x1" edc:desc="GPBRx Read Protection"/>
            <edc:SFRFieldDef edc:cname="GPBRRP7" edc:nzwidth="0x1" edc:desc="GPBRx Read Protection"/>
            <edc:SFRFieldDef edc:cname="GPBRRP8" edc:nzwidth="0x1" edc:desc="GPBRx Read Protection"/>
            <edc:SFRFieldDef edc:cname="GPBRRP9" edc:nzwidth="0x1" edc:desc="GPBRx Read Protection"/>
            <edc:SFRFieldDef edc:cname="GPBRRP10" edc:nzwidth="0x1" edc:desc="GPBRx Read Protection"/>
            <edc:SFRFieldDef edc:cname="GPBRRP11" edc:nzwidth="0x1" edc:desc="GPBRx Read Protection"/>
            <edc:SFRFieldDef edc:cname="GPBRRP12" edc:nzwidth="0x1" edc:desc="GPBRx Read Protection"/>
            <edc:SFRFieldDef edc:cname="GPBRRP13" edc:nzwidth="0x1" edc:desc="GPBRx Read Protection"/>
            <edc:SFRFieldDef edc:cname="GPBRRP14" edc:nzwidth="0x1" edc:desc="GPBRx Read Protection"/>
            <edc:SFRFieldDef edc:cname="GPBRRP15" edc:nzwidth="0x1" edc:desc="GPBRx Read Protection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
