Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/edc/PIC32CX5112MTSH128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_TIMALR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40053110">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="UTC_TIME" edc:nzwidth="0x20" edc:desc="UTC_TIME Alarm"/>
            <edc:AdjustPoint edc:offset="-25"/>
            <edc:SFRFieldDef edc:cname="SECEN" edc:nzwidth="0x1" edc:desc="Second Alarm Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The second-matching alarm is disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The second-matching alarm is enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MIN" edc:nzwidth="0x7" edc:desc="Minute Alarm"/>
            <edc:SFRFieldDef edc:cname="MINEN" edc:nzwidth="0x1" edc:desc="Minute Alarm Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The minute-matching alarm is disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The minute-matching alarm is enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="HOUR" edc:nzwidth="0x6" edc:desc="Hour Alarm"/>
            <edc:SFRFieldDef edc:cname="AMPM" edc:nzwidth="0x1" edc:desc="AM/PM Indicator"/>
            <edc:SFRFieldDef edc:cname="HOUREN" edc:nzwidth="0x1" edc:desc="Hour Alarm Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The hour-matching alarm is disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The hour-matching alarm is enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_CALALR" edc:nzwidth="0x20" edc:access="n-nnnnnnn--nnnnn---------------n" edc:impl="0xBF9F0001" edc:_addr="0x40053114">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="UTCEN" edc:nzwidth="0x1" edc:desc="UTC Alarm Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The UTC-matching alarm is disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The UTC-matching alarm is enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0xF"/>
            <edc:SFRFieldDef edc:cname="MONTH" edc:nzwidth="0x5" edc:desc="Month Alarm"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MTHEN" edc:nzwidth="0x1" edc:desc="Month Alarm Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The month-matching alarm is disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The month-matching alarm is enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATE" edc:nzwidth="0x6" edc:desc="Date Alarm"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DATEEN" edc:nzwidth="0x1" edc:desc="Date Alarm Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="The date-matching alarm is disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="The date-matching alarm is enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_SR" edc:nzwidth="0x20" edc:access="--------------------------rrrrrr" edc:impl="0x3F" edc:_addr="0x40053118">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="ACKUPD" edc:nzwidth="0x1" edc:desc="Acknowledge for Update">
              <edc:SFRFieldSemantic edc:cname="FREERUN" edc:desc="Time and calendar registers cannot be updated." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="UPDATE" edc:desc="Time and calendar registers can be updated." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ALARM" edc:nzwidth="0x1" edc:desc="Alarm Flag">
              <edc:SFRFieldSemantic edc:cname="NO_ALARMEVENT" edc:desc="No alarm matching condition occurred." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ALARMEVENT" edc:desc="An alarm matching condition has occurred." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SEC" edc:nzwidth="0x1" edc:desc="Second Event">
              <edc:SFRFieldSemantic edc:cname="NO_SECEVENT" edc:desc="No second event has occurred since the last clear." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SECEVENT" edc:desc="At least one second event has occurred since the last clear." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TIMEV" edc:nzwidth="0x1" edc:desc="Time Event">
              <edc:SFRFieldSemantic edc:cname="NO_TIMEVENT" edc:desc="No time event has occurred since the last clear." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="TIMEVENT" edc:desc="At least one time event has occurred since the last clear." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CALEV" edc:nzwidth="0x1" edc:desc="Calendar Event">
              <edc:SFRFieldSemantic edc:cname="NO_CALEVENT" edc:desc="No calendar event has occurred since the last clear." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CALEVENT" edc:desc="At least one calendar event has occurred since the last clear." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TDERR" edc:nzwidth="0x1" edc:desc="Time and/or Date Free Running Error">
              <edc:SFRFieldSemantic edc:cname="CORRECT" edc:desc="The internal free running counters are carrying valid values since the last read of the Status Register (RTC_SR)." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ERR_TIMEDATE" edc:desc="The internal free running counters have been corrupted (invalid date or time, non-BCD values) since the last read and/or they are still invalid." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_SCCR" edc:nzwidth="0x20" edc:access="--------------------------wwwwww" edc:impl="0x3F" edc:_addr="0x4005311C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="ACKCLR" edc:nzwidth="0x1" edc:desc="Acknowledge Clear"/>
            <edc:SFRFieldDef edc:cname="ALRCLR" edc:nzwidth="0x1" edc:desc="Alarm Clear"/>
            <edc:SFRFieldDef edc:cname="SECCLR" edc:nzwidth="0x1" edc:desc="Second Clear"/>
            <edc:SFRFieldDef edc:cname="TIMCLR" edc:nzwidth="0x1" edc:desc="Time Clear"/>
            <edc:SFRFieldDef edc:cname="CALCLR" edc:nzwidth="0x1" edc:desc="Calendar Clear"/>
            <edc:SFRFieldDef edc:cname="TDERRCLR" edc:nzwidth="0x1" edc:desc="Time and/or Date Free Running Error Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_IER" edc:nzwidth="0x20" edc:access="--------------------------wwwwww" edc:impl="0x3F" edc:_addr="0x40053120">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="ACKEN" edc:nzwidth="0x1" edc:desc="Acknowledge Update Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ALREN" edc:nzwidth="0x1" edc:desc="Alarm Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SECEN" edc:nzwidth="0x1" edc:desc="Second Event Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TIMEN" edc:nzwidth="0x1" edc:desc="Time Event Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CALEN" edc:nzwidth="0x1" edc:desc="Calendar Event Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TDERREN" edc:nzwidth="0x1" edc:desc="Time and/or Date Error Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_IDR" edc:nzwidth="0x20" edc:access="--------------------------wwwwww" edc:impl="0x3F" edc:_addr="0x40053124">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="ACKDIS" edc:nzwidth="0x1" edc:desc="Acknowledge Update Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="ALRDIS" edc:nzwidth="0x1" edc:desc="Alarm Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="SECDIS" edc:nzwidth="0x1" edc:desc="Second Event Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TIMDIS" edc:nzwidth="0x1" edc:desc="Time Event Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CALDIS" edc:nzwidth="0x1" edc:desc="Calendar Event Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TDERRDIS" edc:nzwidth="0x1" edc:desc="Time and/or Date Error Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
