Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/edc/PIC32CX5112MTSH128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="SUPC_IDR" edc:nzwidth="0x20" edc:access="--------------ww-----------wwwww" edc:impl="0x3001F" edc:_addr="0x400531FC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="LPDBC0" edc:nzwidth="0x1" edc:desc="WKUPx Pin Tamper Detection Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LPDBC1" edc:nzwidth="0x1" edc:desc="WKUPx Pin Tamper Detection Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LPDBC2" edc:nzwidth="0x1" edc:desc="WKUPx Pin Tamper Detection Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LPDBC3" edc:nzwidth="0x1" edc:desc="WKUPx Pin Tamper Detection Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LPDBC4" edc:nzwidth="0x1" edc:desc="WKUPx Pin Tamper Detection Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="VDD3V3SMEV" edc:nzwidth="0x1" edc:desc="VDD3V3 Supply Monitor Event Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="VBATSMEV" edc:nzwidth="0x1" edc:desc="VBAT Supply Monitor Event Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="SUPC_IMR" edc:nzwidth="0x20" edc:access="--------------rr-----------rrrrr" edc:impl="0x3001F" edc:_addr="0x40053200">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="LPDBC0" edc:nzwidth="0x1" edc:desc="WKUPx Pin Tamper Detection Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LPDBC1" edc:nzwidth="0x1" edc:desc="WKUPx Pin Tamper Detection Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LPDBC2" edc:nzwidth="0x1" edc:desc="WKUPx Pin Tamper Detection Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LPDBC3" edc:nzwidth="0x1" edc:desc="WKUPx Pin Tamper Detection Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LPDBC4" edc:nzwidth="0x1" edc:desc="WKUPx Pin Tamper Detection Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="VDD3V3SMEV" edc:nzwidth="0x1" edc:desc="VDD3V3 Supply Monitor Event Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="VBATSMEV" edc:nzwidth="0x1" edc:desc="VBAT Supply Monitor Event Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="SUPC_ISR" edc:nzwidth="0x20" edc:access="--------------rr-----------rrrrr" edc:impl="0x3001F" edc:_addr="0x40053204">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="LPDBC0" edc:nzwidth="0x1" edc:desc="WKUPx Pin Tamper Detection Interrupt Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="LPDBC1" edc:nzwidth="0x1" edc:desc="WKUPx Pin Tamper Detection Interrupt Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="LPDBC2" edc:nzwidth="0x1" edc:desc="WKUPx Pin Tamper Detection Interrupt Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="LPDBC3" edc:nzwidth="0x1" edc:desc="WKUPx Pin Tamper Detection Interrupt Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="LPDBC4" edc:nzwidth="0x1" edc:desc="WKUPx Pin Tamper Detection Interrupt Status (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="VDD3V3SMEV" edc:nzwidth="0x1" edc:desc="VDD3V3 Supply Monitor Event Interrupt Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="VBATSMEV" edc:nzwidth="0x1" edc:desc="VBAT Supply Monitor Event Interrupt Status (cleared on read)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x40053208"/>
      <edc:SFRDef ltx:memberofperipheral="DWDT" edc:cname="WDT0_CR" edc:nzwidth="0x20" edc:access="wwwwwwww-------------------w---w" edc:impl="0xFF000011" edc:_addr="0x40053210">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWDT">
            <edc:SFRFieldDef edc:cname="WDRSTT" edc:nzwidth="0x1" edc:desc="Watchdog Restart"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="LOCKMR" edc:nzwidth="0x1" edc:desc="Lock Mode Register Write Access"/>
            <edc:AdjustPoint edc:offset="0x13"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x8" edc:desc="Password">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation." edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWDT" edc:cname="WDT0_MR" edc:nzwidth="0x20" edc:access="-nnn---------------n--n---nn----" edc:impl="0x70001230" edc:_addr="0x40053214">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWDT">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PERIODRST" edc:nzwidth="0x1" edc:desc="Period Reset"/>
            <edc:SFRFieldDef edc:cname="RPTHRST" edc:nzwidth="0x1" edc:desc="Repeat Threshold Reset"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="WDNRSTDIS" edc:nzwidth="0x1" edc:desc="Watchdog NRST Disable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WDDIS" edc:nzwidth="0x1" edc:desc="Watchdog Disable"/>
            <edc:AdjustPoint edc:offset="0xF"/>
            <edc:SFRFieldDef edc:cname="WDIDLEHLT" edc:nzwidth="0x1" edc:desc="Watchdog Idle Halt"/>
            <edc:SFRFieldDef edc:cname="WDDBG0HLT" edc:nzwidth="0x1" edc:desc="Watchdog Core 0 Debug Halt"/>
            <edc:SFRFieldDef edc:cname="WDDBG1HLT" edc:nzwidth="0x1" edc:desc="Watchdog Core 1 Debug Halt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWDT" edc:cname="WDT0_VR" edc:nzwidth="0x20" edc:access="--------------------rrrrrrrrrrrr" edc:impl="0xFFF" edc:_addr="0x40053218">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWDT">
            <edc:SFRFieldDef edc:cname="COUNTER" edc:nzwidth="0xC" edc:desc="Watchdog Down Counter Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWDT" edc:cname="WDT0_WL" edc:nzwidth="0x20" edc:access="----nnnnnnnnnnnn----nnnnnnnnnnnn" edc:impl="0xFFF0FFF" edc:_addr="0x4005321C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWDT">
            <edc:SFRFieldDef edc:cname="PERIOD" edc:nzwidth="0xC" edc:desc="Watchdog Period"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RPTH" edc:nzwidth="0xC" edc:desc="Repeat Threshold"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWDT" edc:cname="WDT0_IL" edc:nzwidth="0x20" edc:access="-------------nnn----nnnnnnnnnnnn" edc:impl="0x70FFF" edc:_addr="0x40053220">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWDT">
            <edc:SFRFieldDef edc:cname="LVLTH" edc:nzwidth="0xC" edc:desc="Level Threshold"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PRESC" edc:nzwidth="0x3" edc:desc="Prescaler Ratio">
              <edc:SFRFieldSemantic edc:cname="RATIO128" edc:desc="The watchdog counter decreased when the prescaler reaches 128." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="RATIO64" edc:desc="The watchdog counter decreased when the prescaler reaches 64." edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="RATIO32" edc:desc="The watchdog counter decreased when the prescaler reaches 32." edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="RATIO16" edc:desc="The watchdog counter decreased when the prescaler reaches 16." edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="RATIO8" edc:desc="The watchdog counter decreased when the prescaler reaches 8." edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="RATIO4" edc:desc="The watchdog counter decreased when the prescaler reaches 4." edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="RATIO2" edc:desc="The watchdog counter decreased when the prescaler reaches 2." edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="RATIO1" edc:desc="The watchdog counter decreased when the prescaler reaches 1." edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWDT" edc:cname="WDT0_IER" edc:nzwidth="0x20" edc:access="--------------------------wwwwww" edc:impl="0x3F" edc:_addr="0x40053224">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWDT">
            <edc:SFRFieldDef edc:cname="PERINT" edc:nzwidth="0x1" edc:desc="Overflow Period Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RPTHINT" edc:nzwidth="0x1" edc:desc="Reload Repeat Period Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LVLINT" edc:nzwidth="0x1" edc:desc="Interrupt Level Threshold Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="W1PERINT" edc:nzwidth="0x1" edc:desc="Watchdog 1 Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="W1RPTHINT" edc:nzwidth="0x1" edc:desc="Watchdog 1 Repeat Threshold Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RLDERR" edc:nzwidth="0x1" edc:desc="Reload Command Error Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWDT" edc:cname="WDT0_IDR" edc:nzwidth="0x20" edc:access="--------------------------wwwwww" edc:impl="0x3F" edc:_addr="0x40053228">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWDT">
            <edc:SFRFieldDef edc:cname="PERINT" edc:nzwidth="0x1" edc:desc="Overflow Period Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RPTHINT" edc:nzwidth="0x1" edc:desc="Reload Repeat Period Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LVLINT" edc:nzwidth="0x1" edc:desc="Interrupt Level Threshold Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="W1PERINT" edc:nzwidth="0x1" edc:desc="Watchdog 1 Overflow Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="W1RPTHINT" edc:nzwidth="0x1" edc:desc="Watchdog 1 Repeat Threshold Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RLDERR" edc:nzwidth="0x1" edc:desc="Reload Command Error Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWDT" edc:cname="WDT0_ISR" edc:nzwidth="0x20" edc:access="--------------------------rrrrrr" edc:impl="0x3F" edc:_addr="0x4005322C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWDT">
            <edc:SFRFieldDef edc:cname="PERINT" edc:nzwidth="0x1" edc:desc="Overflow Period Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="RPTHINT" edc:nzwidth="0x1" edc:desc="Reload Repeat Period Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="LVLINT" edc:nzwidth="0x1" edc:desc="Interrupt Level Threshold Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="W1PERINT" edc:nzwidth="0x1" edc:desc="Watchdog 1 Overflow Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="W1RPTHINT" edc:nzwidth="0x1" edc:desc="Watchdog 1 Repeat Threshold Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="RLDERR" edc:nzwidth="0x1" edc:desc="Reload Command Error Status (cleared on read)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWDT" edc:cname="WDT0_IMR" edc:nzwidth="0x20" edc:access="--------------------------rrrrrr" edc:impl="0x3F" edc:_addr="0x40053230">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWDT">
            <edc:SFRFieldDef edc:cname="PERINT" edc:nzwidth="0x1" edc:desc="Overflow Period Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RPTHINT" edc:nzwidth="0x1" edc:desc="Reload Repeat Period Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LVLINT" edc:nzwidth="0x1" edc:desc="Interrupt Level Threshold Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="W1PERINT" edc:nzwidth="0x1" edc:desc="Watchdog 1 Overflow Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="W1RPTHINT" edc:nzwidth="0x1" edc:desc="Watchdog 1 Repeat Threshold Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RLDERR" edc:nzwidth="0x1" edc:desc="Reload Command Error Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWDT" edc:cname="WDT1_LVLLIM" edc:nzwidth="0x20" edc:access="----nnnnnnnnnnnn----nnnnnnnnnnnn" edc:impl="0xFFF0FFF" edc:_addr="0x40053234">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWDT">
            <edc:SFRFieldDef edc:cname="LVLMIN" edc:nzwidth="0xC" edc:desc="Minimum Level"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="LVLMAX" edc:nzwidth="0xC" edc:desc="Maximum Level"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
