Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/edc/PIC32CX5112MTSH128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PLL_ISR1" edc:nzwidth="0x20" edc:access="-------------rrr-------------rrr" edc:impl="0x70007" edc:_addr="0x468000F4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="UDR0" edc:nzwidth="0x1" edc:desc="PLLx Underflow"/>
            <edc:SFRFieldDef edc:cname="UDR1" edc:nzwidth="0x1" edc:desc="PLLx Underflow"/>
            <edc:SFRFieldDef edc:cname="UDR2" edc:nzwidth="0x1" edc:desc="PLLx Underflow"/>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="OVR0" edc:nzwidth="0x1" edc:desc="PLLx Overflow"/>
            <edc:SFRFieldDef edc:cname="OVR1" edc:nzwidth="0x1" edc:desc="PLLx Overflow"/>
            <edc:SFRFieldDef edc:cname="OVR2" edc:nzwidth="0x1" edc:desc="PLLx Overflow"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x17FFF08" edc:_addr="0x468000F8"/>
      <edc:SFRDef ltx:memberofperipheral="EMAFE" edc:cname="EMAFE_CR" edc:nzwidth="0x20" edc:access="------------------------------ww" edc:impl="0x3" edc:_addr="0x48000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EMAFE">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="SWRST_DECIM" edc:nzwidth="0x1" edc:desc="Sinc Decimation Filters Reset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EMAFE" edc:cname="EMAFE_MR" edc:nzwidth="0x20" edc:access="--nnnnnnnnnn-nnnn--nnnnnn--nnnnn" edc:impl="0x3FF79F9F" edc:_addr="0x48000004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EMAFE">
            <edc:SFRFieldDef edc:cname="LPF_ON0" edc:nzwidth="0x1" edc:desc="Low-Pass Filter 0 On"/>
            <edc:SFRFieldDef edc:cname="LPF_ON1" edc:nzwidth="0x1" edc:desc="Low-Pass Filter 1 On"/>
            <edc:SFRFieldDef edc:cname="LPF_ON2" edc:nzwidth="0x1" edc:desc="Low-Pass Filter 2 On"/>
            <edc:SFRFieldDef edc:cname="LPF_ON3" edc:nzwidth="0x1" edc:desc="Low-Pass Filter 3 On"/>
            <edc:SFRFieldDef edc:cname="LPF_ON4" edc:nzwidth="0x1" edc:desc="Low-Pass Filter 4 On"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DMA_ON" edc:nzwidth="0x1" edc:desc="Direct Memory Access On"/>
            <edc:SFRFieldDef edc:cname="DMACH0" edc:nzwidth="0x1" edc:desc="Channel 0 Enable for DMA transfer"/>
            <edc:SFRFieldDef edc:cname="DMACH1" edc:nzwidth="0x1" edc:desc="Channel 1 Enable for DMA transfer"/>
            <edc:SFRFieldDef edc:cname="DMACH2" edc:nzwidth="0x1" edc:desc="Channel 2 Enable for DMA transfer"/>
            <edc:SFRFieldDef edc:cname="DMACH3" edc:nzwidth="0x1" edc:desc="Channel 3 Enable for DMA transfer"/>
            <edc:SFRFieldDef edc:cname="DMACH4" edc:nzwidth="0x1" edc:desc="Channel 4 Enable for DMA transfer"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="VAR_ON" edc:nzwidth="0x1" edc:desc="Variation Detection On"/>
            <edc:SFRFieldDef edc:cname="VAR_CH" edc:nzwidth="0x3" edc:desc="Variation Detection Channel Selection">
              <edc:SFRFieldSemantic edc:cname="CH0" edc:desc="Channel 0 is selected." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CH1" edc:desc="Channel 1 is selected." edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CH2" edc:desc="Channel 2 is selected." edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="CH3" edc:desc="Channel 3 is selected." edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="CH4" edc:desc="Channel 4 is selected." edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="CH5" edc:desc="Channel 5 is selected." edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="CH6" edc:desc="Channel 6 is selected." edc:when="(field &amp; 0x7) == 0x6"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VAR_LIMIT" edc:nzwidth="0xA" edc:desc="Variation Detection Limit for Event Triggering"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EMAFE" edc:cname="EMAFE_CDCR" edc:nzwidth="0x20" edc:access="----nnnnnnnnnnnnnnnn---n-nnn-nnn" edc:impl="0xFFFF177" edc:_addr="0x48000008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EMAFE">
            <edc:SFRFieldDef edc:cname="CHA_IDX" edc:nzwidth="0x3" edc:desc="First Channel to Compare">
              <edc:SFRFieldSemantic edc:cname="CH0" edc:desc="Channel 0 is used to perform comparison." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CH1" edc:desc="Channel 1 is used to perform comparison." edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CH2" edc:desc="Channel 2 is used to perform comparison." edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="CH3" edc:desc="Channel 3 is used to perform comparison." edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="CH4" edc:desc="Channel 4 is used to perform comparison." edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="CH5" edc:desc="Channel 5 is used to perform comparison." edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="CH6" edc:desc="Channel 6 is used to perform comparison." edc:when="(field &amp; 0x7) == 0x6"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CHB_IDX" edc:nzwidth="0x3" edc:desc="Second Channel to Compare">
              <edc:SFRFieldSemantic edc:cname="CH0" edc:desc="Channel 0 is used to perform comparison" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CH1" edc:desc="Channel 1 is used to perform comparison" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CH2" edc:desc="Channel 2 is used to perform comparison" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="CH3" edc:desc="Channel 3 is used to perform comparison" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="CH4" edc:desc="Channel 4 is used to perform comparison" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="CH5" edc:desc="Channel 5 is used to perform comparison." edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="CH6" edc:desc="Channel 6 is used to perform comparison." edc:when="(field &amp; 0x7) == 0x6"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DIFFTYPE" edc:nzwidth="0x1" edc:desc="Type of Comparison"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DIFFCOUNT" edc:nzwidth="0x4" edc:desc="Successive Comparison Event Count"/>
            <edc:SFRFieldDef edc:cname="DIFFTHRES" edc:nzwidth="0xC" edc:desc="Threshold"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EMAFE" edc:cname="EMAFE_EMR" edc:nzwidth="0x20" edc:access="---------------------nnnnnnn--nn" edc:impl="0x7F3" edc:_addr="0x4800000C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EMAFE">
            <edc:SFRFieldDef edc:cname="FORMAT" edc:nzwidth="0x2" edc:desc="Data Format">
              <edc:SFRFieldSemantic edc:cname="NB_CHANNEL" edc:desc="Index of channel is added in register EMAFE_DMA_DATA. 24-bit dynamic range. (default)." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SIGNEXTEND" edc:desc="24-bit value with sign extension up to 32-bit applied to registers EMAFE_DMA_DATA and EMAFE _DATAx. 24-bit dynamic range" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FULLRANGE" edc:desc="32-bit full range signed extension is applied in EMAFE_DMA_DATA and EMAFE _DATAx. 32-bit dynamic range." edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MCLKDIV_LPF" edc:nzwidth="0x4" edc:desc="LPF Clock Prescaler Ratio">
              <edc:SFRFieldSemantic edc:cname="MCLK" edc:desc="LPFIF clock is MCLK/1." edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MCLKDIV2" edc:desc="LPFIF clock is MCLK/2." edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MCLKDIV4" edc:desc="LPFIF clock is MCLK/4." edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MCLKDIV8" edc:desc="LPFIF clock is MCLK/8. (Default)" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="MCLKDIV16" edc:desc="LPFIF clock is MCLK/16." edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="MCLKDIV32" edc:desc="LPFIF clock is MCLK/32." edc:when="(field &amp; 0xF) == 0x5"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="OSR" edc:nzwidth="0x3" edc:desc="OSR of the Decimation Filters">
              <edc:SFRFieldSemantic edc:cname="OSR8" edc:desc="OSR of the system is 8." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="OSR16" edc:desc="OSR of the system is 16." edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="OSR32" edc:desc="OSR of the system is 32." edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="OSR64" edc:desc="OSR of the system is 64 (Default)." edc:when="(field &amp; 0x7) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
