Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/edc/PIC32CX5112MTSH128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_SCUP" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x4801C02C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="UPR" edc:nzwidth="0x4" edc:desc="Update Period"/>
            <edc:SFRFieldDef edc:cname="UPRCNT" edc:nzwidth="0x4" edc:desc="Update Period Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_SCUPUPD" edc:nzwidth="0x20" edc:access="----------------------------wwww" edc:impl="0xF" edc:_addr="0x4801C030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="UPRUPD" edc:nzwidth="0x4" edc:desc="Update Period Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_IER2" edc:nzwidth="0x20" edc:access="--------wwwwwwwwwwwwwwww----wwww" edc:impl="0xFFFF0F" edc:_addr="0x4801C034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="WRDY" edc:nzwidth="0x1" edc:desc="Write Ready for Synchronous Channels Update Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="PDC End of TX Buffer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="PDC TX Buffer Empty Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="Synchronous Channels Update Underrun Error Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CMPM0" edc:nzwidth="0x1" edc:desc="Comparison 0 Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPM1" edc:nzwidth="0x1" edc:desc="Comparison 1 Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPM2" edc:nzwidth="0x1" edc:desc="Comparison 2 Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPM3" edc:nzwidth="0x1" edc:desc="Comparison 3 Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPM4" edc:nzwidth="0x1" edc:desc="Comparison 4 Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPM5" edc:nzwidth="0x1" edc:desc="Comparison 5 Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPM6" edc:nzwidth="0x1" edc:desc="Comparison 6 Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPM7" edc:nzwidth="0x1" edc:desc="Comparison 7 Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPU0" edc:nzwidth="0x1" edc:desc="Comparison 0 Update Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPU1" edc:nzwidth="0x1" edc:desc="Comparison 1 Update Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPU2" edc:nzwidth="0x1" edc:desc="Comparison 2 Update Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPU3" edc:nzwidth="0x1" edc:desc="Comparison 3 Update Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPU4" edc:nzwidth="0x1" edc:desc="Comparison 4 Update Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPU5" edc:nzwidth="0x1" edc:desc="Comparison 5 Update Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPU6" edc:nzwidth="0x1" edc:desc="Comparison 6 Update Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPU7" edc:nzwidth="0x1" edc:desc="Comparison 7 Update Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_IDR2" edc:nzwidth="0x20" edc:access="--------wwwwwwwwwwwwwwww----wwww" edc:impl="0xFFFF0F" edc:_addr="0x4801C038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="WRDY" edc:nzwidth="0x1" edc:desc="Write Ready for Synchronous Channels Update Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="PDC End of TX Buffer Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="PDC TX Buffer Empty Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="Synchronous Channels Update Underrun Error Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CMPM0" edc:nzwidth="0x1" edc:desc="Comparison 0 Match Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPM1" edc:nzwidth="0x1" edc:desc="Comparison 1 Match Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPM2" edc:nzwidth="0x1" edc:desc="Comparison 2 Match Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPM3" edc:nzwidth="0x1" edc:desc="Comparison 3 Match Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPM4" edc:nzwidth="0x1" edc:desc="Comparison 4 Match Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPM5" edc:nzwidth="0x1" edc:desc="Comparison 5 Match Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPM6" edc:nzwidth="0x1" edc:desc="Comparison 6 Match Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPM7" edc:nzwidth="0x1" edc:desc="Comparison 7 Match Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPU0" edc:nzwidth="0x1" edc:desc="Comparison 0 Update Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPU1" edc:nzwidth="0x1" edc:desc="Comparison 1 Update Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPU2" edc:nzwidth="0x1" edc:desc="Comparison 2 Update Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPU3" edc:nzwidth="0x1" edc:desc="Comparison 3 Update Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPU4" edc:nzwidth="0x1" edc:desc="Comparison 4 Update Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPU5" edc:nzwidth="0x1" edc:desc="Comparison 5 Update Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPU6" edc:nzwidth="0x1" edc:desc="Comparison 6 Update Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPU7" edc:nzwidth="0x1" edc:desc="Comparison 7 Update Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_IMR2" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr----rrrr" edc:impl="0xFFFF0F" edc:_addr="0x4801C03C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="WRDY" edc:nzwidth="0x1" edc:desc="Write Ready for Synchronous Channels Update Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="PDC End of TX Buffer Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="PDC TX Buffer Empty Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="Synchronous Channels Update Underrun Error Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CMPM0" edc:nzwidth="0x1" edc:desc="Comparison 0 Match Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPM1" edc:nzwidth="0x1" edc:desc="Comparison 1 Match Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPM2" edc:nzwidth="0x1" edc:desc="Comparison 2 Match Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPM3" edc:nzwidth="0x1" edc:desc="Comparison 3 Match Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPM4" edc:nzwidth="0x1" edc:desc="Comparison 4 Match Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPM5" edc:nzwidth="0x1" edc:desc="Comparison 5 Match Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPM6" edc:nzwidth="0x1" edc:desc="Comparison 6 Match Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPM7" edc:nzwidth="0x1" edc:desc="Comparison 7 Match Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPU0" edc:nzwidth="0x1" edc:desc="Comparison 0 Update Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPU1" edc:nzwidth="0x1" edc:desc="Comparison 1 Update Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPU2" edc:nzwidth="0x1" edc:desc="Comparison 2 Update Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPU3" edc:nzwidth="0x1" edc:desc="Comparison 3 Update Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPU4" edc:nzwidth="0x1" edc:desc="Comparison 4 Update Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPU5" edc:nzwidth="0x1" edc:desc="Comparison 5 Update Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPU6" edc:nzwidth="0x1" edc:desc="Comparison 6 Update Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPU7" edc:nzwidth="0x1" edc:desc="Comparison 7 Update Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_ISR2" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr----rrrr" edc:impl="0xFFFF0F" edc:_addr="0x4801C040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="WRDY" edc:nzwidth="0x1" edc:desc="Write Ready for Synchronous Channels Update"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="PDC End of TX Buffer"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="PDC TX Buffer Empty"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="Synchronous Channels Update Underrun Error"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CMPM0" edc:nzwidth="0x1" edc:desc="Comparison 0 Match"/>
            <edc:SFRFieldDef edc:cname="CMPM1" edc:nzwidth="0x1" edc:desc="Comparison 1 Match"/>
            <edc:SFRFieldDef edc:cname="CMPM2" edc:nzwidth="0x1" edc:desc="Comparison 2 Match"/>
            <edc:SFRFieldDef edc:cname="CMPM3" edc:nzwidth="0x1" edc:desc="Comparison 3 Match"/>
            <edc:SFRFieldDef edc:cname="CMPM4" edc:nzwidth="0x1" edc:desc="Comparison 4 Match"/>
            <edc:SFRFieldDef edc:cname="CMPM5" edc:nzwidth="0x1" edc:desc="Comparison 5 Match"/>
            <edc:SFRFieldDef edc:cname="CMPM6" edc:nzwidth="0x1" edc:desc="Comparison 6 Match"/>
            <edc:SFRFieldDef edc:cname="CMPM7" edc:nzwidth="0x1" edc:desc="Comparison 7 Match"/>
            <edc:SFRFieldDef edc:cname="CMPU0" edc:nzwidth="0x1" edc:desc="Comparison 0 Update"/>
            <edc:SFRFieldDef edc:cname="CMPU1" edc:nzwidth="0x1" edc:desc="Comparison 1 Update"/>
            <edc:SFRFieldDef edc:cname="CMPU2" edc:nzwidth="0x1" edc:desc="Comparison 2 Update"/>
            <edc:SFRFieldDef edc:cname="CMPU3" edc:nzwidth="0x1" edc:desc="Comparison 3 Update"/>
            <edc:SFRFieldDef edc:cname="CMPU4" edc:nzwidth="0x1" edc:desc="Comparison 4 Update"/>
            <edc:SFRFieldDef edc:cname="CMPU5" edc:nzwidth="0x1" edc:desc="Comparison 5 Update"/>
            <edc:SFRFieldDef edc:cname="CMPU6" edc:nzwidth="0x1" edc:desc="Comparison 6 Update"/>
            <edc:SFRFieldDef edc:cname="CMPU7" edc:nzwidth="0x1" edc:desc="Comparison 7 Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_OOV" edc:nzwidth="0x20" edc:access="-------------nnn-------------nnn" edc:impl="0x70007" edc:_addr="0x4801C044">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="OOVH0" edc:nzwidth="0x1" edc:desc="Output Override Value for PWMH output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OOVH1" edc:nzwidth="0x1" edc:desc="Output Override Value for PWMH output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OOVH2" edc:nzwidth="0x1" edc:desc="Output Override Value for PWMH output of the channel 2"/>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="OOVL0" edc:nzwidth="0x1" edc:desc="Output Override Value for PWML output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OOVL1" edc:nzwidth="0x1" edc:desc="Output Override Value for PWML output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OOVL2" edc:nzwidth="0x1" edc:desc="Output Override Value for PWML output of the channel 2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_OS" edc:nzwidth="0x20" edc:access="-------------nnn-------------nnn" edc:impl="0x70007" edc:_addr="0x4801C048">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="OSH0" edc:nzwidth="0x1" edc:desc="Output Selection for PWMH output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSH1" edc:nzwidth="0x1" edc:desc="Output Selection for PWMH output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSH2" edc:nzwidth="0x1" edc:desc="Output Selection for PWMH output of the channel 2"/>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="OSL0" edc:nzwidth="0x1" edc:desc="Output Selection for PWML output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSL1" edc:nzwidth="0x1" edc:desc="Output Selection for PWML output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSL2" edc:nzwidth="0x1" edc:desc="Output Selection for PWML output of the channel 2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_OSS" edc:nzwidth="0x20" edc:access="-------------www-------------www" edc:impl="0x70007" edc:_addr="0x4801C04C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="OSSH0" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWMH output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSSH1" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWMH output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSSH2" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWMH output of the channel 2"/>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="OSSL0" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWML output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSSL1" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWML output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSSL2" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWML output of the channel 2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_OSC" edc:nzwidth="0x20" edc:access="-------------www-------------www" edc:impl="0x70007" edc:_addr="0x4801C050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="OSCH0" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWMH output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSCH1" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWMH output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSCH2" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWMH output of the channel 2"/>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="OSCL0" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWML output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSCL1" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWML output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSCL2" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWML output of the channel 2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_OSSUPD" edc:nzwidth="0x20" edc:access="-------------www-------------www" edc:impl="0x70007" edc:_addr="0x4801C054">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="OSSUPH0" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWMH output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSSUPH1" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWMH output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSSUPH2" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWMH output of the channel 2"/>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="OSSUPL0" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWML output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSSUPL1" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWML output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSSUPL2" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWML output of the channel 2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_OSCUPD" edc:nzwidth="0x20" edc:access="-------------www-------------www" edc:impl="0x70007" edc:_addr="0x4801C058">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="OSCUPH0" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWMH output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSCUPH1" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWMH output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSCUPH2" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWMH output of the channel 2"/>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="OSCUPL0" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWML output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSCUPL1" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWML output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSCUPL2" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWML output of the channel 2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_FMR" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x4801C05C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="FPOL" edc:nzwidth="0x8" edc:desc="Fault Polarity"/>
            <edc:SFRFieldDef edc:cname="FMOD" edc:nzwidth="0x8" edc:desc="Fault Activation Mode"/>
            <edc:SFRFieldDef edc:cname="FFIL" edc:nzwidth="0x8" edc:desc="Fault Filtering"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_FSR" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x4801C060">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="FIV" edc:nzwidth="0x8" edc:desc="Fault Input Value"/>
            <edc:SFRFieldDef edc:cname="FS" edc:nzwidth="0x8" edc:desc="Fault Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_FCR" edc:nzwidth="0x20" edc:access="------------------------wwwwwwww" edc:impl="0xFF" edc:_addr="0x4801C064">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="FCLR" edc:nzwidth="0x8" edc:desc="Fault Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_FPV1" edc:nzwidth="0x20" edc:access="-------------nnn-------------nnn" edc:impl="0x70007" edc:_addr="0x4801C068">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="FPVH0" edc:nzwidth="0x1" edc:desc="Fault Protection Value for PWMH output on channel 0"/>
            <edc:SFRFieldDef edc:cname="FPVH1" edc:nzwidth="0x1" edc:desc="Fault Protection Value for PWMH output on channel 1"/>
            <edc:SFRFieldDef edc:cname="FPVH2" edc:nzwidth="0x1" edc:desc="Fault Protection Value for PWMH output on channel 2"/>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="FPVL0" edc:nzwidth="0x1" edc:desc="Fault Protection Value for PWML output on channel 0"/>
            <edc:SFRFieldDef edc:cname="FPVL1" edc:nzwidth="0x1" edc:desc="Fault Protection Value for PWML output on channel 1"/>
            <edc:SFRFieldDef edc:cname="FPVL2" edc:nzwidth="0x1" edc:desc="Fault Protection Value for PWML output on channel 2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
