Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/edc/PIC32CX5112MTSH128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_CH_NUM1PWM_CDTYUPD" edc:nzwidth="0x20" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:impl="0xFFFFFF" edc:_addr="0x4801C228">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="CDTYUPD" edc:nzwidth="0x18" edc:desc="Channel Duty-Cycle Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_CH_NUM1PWM_CPRD" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x4801C22C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="CPRD" edc:nzwidth="0x18" edc:desc="Channel Period"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_CH_NUM1PWM_CPRDUPD" edc:nzwidth="0x20" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:impl="0xFFFFFF" edc:_addr="0x4801C230">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="CPRDUPD" edc:nzwidth="0x18" edc:desc="Channel Period Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_CH_NUM1PWM_CCNT" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:impl="0xFFFFFF" edc:_addr="0x4801C234">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="CNT" edc:nzwidth="0x18" edc:desc="Channel Counter Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_CH_NUM1PWM_DT" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4801C238">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="DTH" edc:nzwidth="0x10" edc:desc="Dead-Time Value for PWMHx Output"/>
            <edc:SFRFieldDef edc:cname="DTL" edc:nzwidth="0x10" edc:desc="Dead-Time Value for PWMLx Output"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_CH_NUM1PWM_DTUPD" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x4801C23C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="DTHUPD" edc:nzwidth="0x10" edc:desc="Dead-Time Value Update for PWMHx Output"/>
            <edc:SFRFieldDef edc:cname="DTLUPD" edc:nzwidth="0x10" edc:desc="Dead-Time Value Update for PWMLx Output"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_CH_NUM2PWM_CMR" edc:nzwidth="0x20" edc:access="------------nnnn--nnnnnn----nnnn" edc:impl="0xF3F0F" edc:_addr="0x4801C240">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="CPRE" edc:nzwidth="0x4" edc:desc="Channel Prescaler">
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Peripheral clock" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_2" edc:desc="Peripheral clock/2" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_4" edc:desc="Peripheral clock/4" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_8" edc:desc="Peripheral clock/8" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_16" edc:desc="Peripheral clock/16" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_32" edc:desc="Peripheral clock/32" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_64" edc:desc="Peripheral clock/64" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_128" edc:desc="Peripheral clock/128" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_256" edc:desc="Peripheral clock/256" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_512" edc:desc="Peripheral clock/512" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_1024" edc:desc="Peripheral clock/1024" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="CLKA" edc:desc="Clock A" edc:when="(field &amp; 0xF) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="CLKB" edc:desc="Clock B" edc:when="(field &amp; 0xF) == 0xC"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CALG" edc:nzwidth="0x1" edc:desc="Channel Alignment">
              <edc:SFRFieldSemantic edc:cname="LEFT_ALIGNED" edc:desc="Left aligned" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CENTER_ALIGNED" edc:desc="Center aligned" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CPOL" edc:nzwidth="0x1" edc:desc="Channel Polarity">
              <edc:SFRFieldSemantic edc:cname="LOW_POLARITY" edc:desc="Waveform starts at low level" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_POLARITY" edc:desc="Waveform starts at high level" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CES" edc:nzwidth="0x1" edc:desc="Counter Event Selection">
              <edc:SFRFieldSemantic edc:cname="SINGLE_EVENT" edc:desc="At the end of PWM period" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DOUBLE_EVENT" edc:desc="At half of PWM period AND at the end of PWM period" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="UPDS" edc:nzwidth="0x1" edc:desc="Update Selection">
              <edc:SFRFieldSemantic edc:cname="UPDATE_AT_PERIOD" edc:desc="At the next end of PWM period" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="UPDATE_AT_HALF_PERIOD" edc:desc="At the next end of Half PWM period" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DPOLI" edc:nzwidth="0x1" edc:desc="Disabled Polarity Inverted"/>
            <edc:SFRFieldDef edc:cname="TCTS" edc:nzwidth="0x1" edc:desc="Timer Counter Trigger Selection"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DTE" edc:nzwidth="0x1" edc:desc="Dead-Time Generator Enable"/>
            <edc:SFRFieldDef edc:cname="DTHI" edc:nzwidth="0x1" edc:desc="Dead-Time PWMHx Output Inverted"/>
            <edc:SFRFieldDef edc:cname="DTLI" edc:nzwidth="0x1" edc:desc="Dead-Time PWMLx Output Inverted"/>
            <edc:SFRFieldDef edc:cname="PPM" edc:nzwidth="0x1" edc:desc="Push-Pull Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_CH_NUM2PWM_CDTY" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x4801C244">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="CDTY" edc:nzwidth="0x18" edc:desc="Channel Duty-Cycle"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_CH_NUM2PWM_CDTYUPD" edc:nzwidth="0x20" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:impl="0xFFFFFF" edc:_addr="0x4801C248">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="CDTYUPD" edc:nzwidth="0x18" edc:desc="Channel Duty-Cycle Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_CH_NUM2PWM_CPRD" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x4801C24C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="CPRD" edc:nzwidth="0x18" edc:desc="Channel Period"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_CH_NUM2PWM_CPRDUPD" edc:nzwidth="0x20" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:impl="0xFFFFFF" edc:_addr="0x4801C250">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="CPRDUPD" edc:nzwidth="0x18" edc:desc="Channel Period Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
