Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/edc/PIC32CX5112MTSH128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_CH_NUM2PWM_CCNT" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:impl="0xFFFFFF" edc:_addr="0x4801C254">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="CNT" edc:nzwidth="0x18" edc:desc="Channel Counter Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_CH_NUM2PWM_DT" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4801C258">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="DTH" edc:nzwidth="0x10" edc:desc="Dead-Time Value for PWMHx Output"/>
            <edc:SFRFieldDef edc:cname="DTL" edc:nzwidth="0x10" edc:desc="Dead-Time Value for PWMLx Output"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_CH_NUM2PWM_DTUPD" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x4801C25C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="DTHUPD" edc:nzwidth="0x10" edc:desc="Dead-Time Value Update for PWMHx Output"/>
            <edc:SFRFieldDef edc:cname="DTLUPD" edc:nzwidth="0x10" edc:desc="Dead-Time Value Update for PWMLx Output"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1A0" edc:_addr="0x4801C260"/>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_CMUPD0" edc:nzwidth="0x20" edc:access="------------------w---w---------" edc:impl="0x2200" edc:_addr="0x4801C400">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="CPOLUP" edc:nzwidth="0x1" edc:desc="Channel Polarity Update"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CPOLINVUP" edc:nzwidth="0x1" edc:desc="Channel Polarity Inversion Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1C" edc:_addr="0x4801C404"/>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_CMUPD1" edc:nzwidth="0x20" edc:access="------------------w---w---------" edc:impl="0x2200" edc:_addr="0x4801C420">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="CPOLUP" edc:nzwidth="0x1" edc:desc="Channel Polarity Update"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CPOLINVUP" edc:nzwidth="0x1" edc:desc="Channel Polarity Inversion Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x4801C424"/>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_ETRG1" edc:nzwidth="0x20" edc:access="nnnn--nnnnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xF3FFFFFF" edc:_addr="0x4801C42C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="MAXCNT" edc:nzwidth="0x18" edc:desc="Maximum Counter value"/>
            <edc:SFRFieldDef edc:cname="TRGMODE" edc:nzwidth="0x2" edc:desc="External Trigger Mode">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="External trigger is not enabled." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MODE1" edc:desc="External PWM Reset Mode" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MODE2" edc:desc="External PWM Start Mode" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MODE3" edc:desc="Cycle-by-cycle Duty Mode" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TRGEDGE" edc:nzwidth="0x1" edc:desc="Edge Selection">
              <edc:SFRFieldSemantic edc:cname="FALLING_ZERO" edc:desc="TRGMODE = 1: TRGINx event detection on falling edge. TRGMODE = 2, 3: TRGINx active level is 0" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RISING_ONE" edc:desc="TRGMODE = 1: TRGINx event detection on rising edge. TRGMODE = 2, 3: TRGINx active level is 1" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TRGFILT" edc:nzwidth="0x1" edc:desc="Filtered input"/>
            <edc:SFRFieldDef edc:cname="TRGSRC" edc:nzwidth="0x1" edc:desc="Trigger Source"/>
            <edc:SFRFieldDef edc:cname="RFEN" edc:nzwidth="0x1" edc:desc="Recoverable Fault Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_LEBR1" edc:nzwidth="0x20" edc:access="------------nnnn---------nnnnnnn" edc:impl="0xF007F" edc:_addr="0x4801C430">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="LEBDELAY" edc:nzwidth="0x7" edc:desc="Leading-Edge Blanking Delay for TRGINx"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="PWMLFEN" edc:nzwidth="0x1" edc:desc="PWML Falling Edge Enable"/>
            <edc:SFRFieldDef edc:cname="PWMLREN" edc:nzwidth="0x1" edc:desc="PWML Rising Edge Enable"/>
            <edc:SFRFieldDef edc:cname="PWMHFEN" edc:nzwidth="0x1" edc:desc="PWMH Falling Edge Enable"/>
            <edc:SFRFieldDef edc:cname="PWMHREN" edc:nzwidth="0x1" edc:desc="PWMH Rising Edge Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x4801C434"/>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_CMUPD2" edc:nzwidth="0x20" edc:access="------------------w---w---------" edc:impl="0x2200" edc:_addr="0x4801C440">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="CPOLUP" edc:nzwidth="0x1" edc:desc="Channel Polarity Update"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CPOLINVUP" edc:nzwidth="0x1" edc:desc="Channel Polarity Inversion Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
