Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/edc/PIC32CX5112MTSH128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="MATRIX3" edc:cname="MATRIX3_PRTSR11" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x480202AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX3">
            <edc:SFRFieldDef edc:cname="PRTOP0" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP1" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP2" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP3" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP4" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP5" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP6" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP7" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX3" edc:cname="MATRIX3_PRTSR12" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x480202B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX3">
            <edc:SFRFieldDef edc:cname="PRTOP0" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP1" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP2" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP3" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP4" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP5" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP6" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP7" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX3" edc:cname="MATRIX3_PRTSR13" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x480202B4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX3">
            <edc:SFRFieldDef edc:cname="PRTOP0" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP1" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP2" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP3" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP4" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP5" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP6" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP7" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX3" edc:cname="MATRIX3_PRTSR14" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x480202B8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX3">
            <edc:SFRFieldDef edc:cname="PRTOP0" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP1" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP2" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP3" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP4" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP5" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP6" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP7" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX3" edc:cname="MATRIX3_PRTSR15" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x480202BC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX3">
            <edc:SFRFieldDef edc:cname="PRTOP0" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP1" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP2" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP3" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP4" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP5" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP6" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP7" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX3" edc:cname="MATRIX3_PPSELR0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x480202C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX3">
            <edc:SFRFieldDef edc:cname="USERP0" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP1" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP2" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP3" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP4" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP5" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP6" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP7" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP8" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP9" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP10" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP11" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP12" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP13" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP14" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP15" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP16" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP17" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP18" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP19" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP20" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP21" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP22" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP23" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP24" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP25" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP26" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP27" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP28" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP29" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP30" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP31" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX3" edc:cname="MATRIX3_PPSELR1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x480202C4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX3">
            <edc:SFRFieldDef edc:cname="USERP0" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP1" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP2" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP3" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP4" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP5" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP6" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP7" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP8" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP9" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP10" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP11" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP12" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP13" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP14" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP15" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP16" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP17" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP18" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP19" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP20" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP21" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP22" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP23" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP24" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP25" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP26" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP27" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP28" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP29" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP30" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP31" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
